Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
l
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:VPC CNI unavailable alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "VPC CNI unavailable alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "170"
              - "__dashboardUid__" = "bj5-ZEhWk"
              - "__panelId__"      = "4"
              - "message"          = "One more instances of VPC CNI are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            } -> null
          - condition      = "A" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "1m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "c8f6677c-18dc-423a-bc2a-191514348b6f"
            } -> null
          - name           = "VPC CNI unavailable alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "cdcru94b0elfkb" -> null

          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0.5,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "B",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "A"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"aws-node\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"aws-node\"})"
                      - format         = "time_series"
                      - intervalFactor = 2
                      - legendFormat   = "Unavailable"
                      - refId          = "B"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Version alerts alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Version alerts alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Version alerts alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "161"
              - "__dashboardUid__" = "YMBzktpGz"
              - "__panelId__"      = "15"
              - "message"          = "Current Kubernetes cluster version is outdated"
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "repeat"   = "24h"
              - "rule_uid" = "b3144065-3094-4403-93dd-b7037b9f563d"
            } -> null
          - name           = "Version alerts alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "bdcru93b2v6dcb" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - datasource     = {
                          - type = "prometheus"
                          - uid  = "prometheus"
                        }
                      - expr           = "eks_version_exporter_is_outdated"
                      - format         = "time_series"
                      - instant        = false
                      - intervalFactor = 1
                      - legendFormat   = "is_outdated"
                      - refId          = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 60 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0.9,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "last"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Volume Snapshot Failure alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Volume Snapshot Failure alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "183"
              - "__dashboardUid__" = "YAniUGC"
              - "__panelId__"      = "34"
              - "message"          = "A volume snapshot using Velero has failed.  Please check Velero to establish the cause of the failure."
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "b8eaf085-5c81-4d2a-b4a7-f2c6c9998e66"
            } -> null
          - name           = "Volume Snapshot Failure alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "ddcru958129z4a" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr         = "rate(velero_volume_snapshot_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      - interval     = ""
                      - legendFormat = ""
                      - refId        = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "last"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Watchdog.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Watchdog" -> null
      - interval_seconds   = 300 -> null
      - name               = "Watchdog" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {} -> null
          - condition      = "C" -> null
          - exec_err_state = "Error" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "repeat" = "24h"
            } -> null
          - name           = "Watchdog" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "fdcru94bd4934b" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - editorMode = "code"
                      - expr       = "vector(1)"
                      - hide       = false
                      - instant    = true
                      - range      = false
                      - refId      = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = []
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "B",
                                    ]
                                }
                              - reducer   = {
                                  - params = []
                                  - type   = "last"
                                }
                              - type      = "query"
                            },
                        ]
                      - datasource = {
                          - type = "__expr__"
                          - uid  = "__expr__"
                        }
                      - expression = "A"
                      - hide       = false
                      - reducer    = "last"
                      - refId      = "B"
                      - type       = "reduce"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "C",
                                    ]
                                }
                              - reducer   = {
                                  - params = []
                                  - type   = "last"
                                }
                              - type      = "query"
                            },
                        ]
                      - datasource = {
                          - type = "__expr__"
                          - uid  = "__expr__"
                        }
                      - expression = "B"
                      - hide       = false
                      - refId      = "C"
                      - type       = "threshold"
                    }
                ) -> null
              - ref_id         = "C" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/API server 5xx errors alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "API server 5xx errors alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "159"
              + "__dashboardUid__" = "4IxKHWtMz"
              + "__panelId__"      = "7"
              + "message"          = "Too many Kubernetes API requests returned  5xx errors in the last 5 minutes."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "cbeff883-8f55-4d33-8295-5f6e1b0e3fc8"
            }
          + name           = "API server 5xx errors alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 25,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "(sum by (code) (code_resource:apiserver_request_total:rate5m{code=~\"5..\"}) / sum by (code) (code_resource:apiserver_request_total:rate5m)) * 100"
                      + interval     = ""
                      + legendFormat = "Rel {{code}}"
                      + refId        = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Backup Validation Failure alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Backup Validation Failure alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "181"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "32"
              + "message"          = "Validation of a velero backup has failed.  Please use the Velero CLI to retrieve the logs to assist in investigation of the issue."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "d80bb8e3-3dd8-44ad-8357-572318f92b84"
            }
          + name           = "Backup Validation Failure alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_backup_validation_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Blackbox probe target is down.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Blackbox probe target is down"

      + rule {
          + annotations    = {
              + "__alertId__"      = "176"
              + "__dashboardUid__" = "bXDq_ZNnz"
              + "__panelId__"      = "190"
              + "message"          = ""
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c2b67b94-5272-4421-9bcc-b72ea73ec41d"
            }
          + name           = "Blackbox probe target is down"
          + no_data_state  = "Alerting"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + exemplar     = true
                      + expr         = "probe_success"
                      + interval     = ""
                      + legendFormat = "{{  instance }}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/CPU Capacity Utilization Alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "CPU Capacity Utilization Alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "157"
              + "__dashboardUid__" = "s_zMzas4z"
              + "__panelId__"      = "4"
              + "message"          = "Elevated CPU capacity utilization"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c5640cc0-039e-4b6e-870a-dd5091acd6ac"
            }
          + name           = "CPU Capacity Utilization Alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.85,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "sum(namespace_cpu:kube_pod_container_resource_requests:sum{}) / sum(kube_node_status_allocatable{resource=\"cpu\"})"
                      + legendFormat = "CPU Capacity Utilization"
                      + range        = true
                      + refId        = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Components version bump alerts alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Components version bump alerts alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "171"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "7"
              + "message"          = "Kubernetes version bump detected. Please see \"Kubernetes Components\" dashboard for more details"
            }
          + condition      = "E"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c72667d9-c358-4f9f-9dac-1bf29ee5e8d8"
            }
          + name           = "Components version bump alerts alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(count by (image) (kube_pod_container_info{namespace=\"kube-system\", container=\"aws-node\"})) - 2"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "cni"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 10
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(count by (image) (kube_pod_container_info{namespace=\"kube-system\", container=\"kube-proxy\"})) - 1"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "kube-proxy"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 10
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(count by (image) (kube_pod_container_info{namespace=\"kube-system\", container=\"coredns\"})) - 1"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "coredns"
                      + refId          = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 10
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(count by (kubelet_version) (kube_node_info)) - 2"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "kubelet"
                      + refId          = "D"
                    }
                )
              + ref_id         = "D"

              + relative_time_range {
                  + from = 10
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "D",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "E"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Container Restarts (5m) alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Container Restarts (5m) alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "155"
              + "__dashboardUid__" = "fxisR13Zz"
              + "__panelId__"      = "4"
              + "message"          = ""
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "eecbadc3-04e9-49ea-9f9c-d9cda5d3773b"
            }
          + name           = "Container Restarts (5m) alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum (rate(kube_pod_container_status_restarts_total{namespace=\"logcollect\", container=\"cloudwatchlogs-collector\"}[5m]) * 60 * 5) by (container)"
                      + format         = "time_series"
                      + instant        = false
                      + interval       = ""
                      + intervalFactor = 1
                      + legendFormat   = "{{ container }}"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 2,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "max"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/CoreDNS unavailable alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "CoreDNS unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "169"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "3"
              + "message"          = "One more instances of CoreDNS are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "be4b444e-c0f1-49f5-b91b-8ab88b846e40"
            }
          + name           = "CoreDNS unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (deployment) (kube_deployment_spec_replicas{namespace=\"kube-system\", deployment=\"coredns\"}) - sum by (deployment) (kube_deployment_status_replicas_available{namespace=\"kube-system\", deployment=\"coredns\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/EC2 Worker Node Credit Balance alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 300
      + name               = "EC2 Worker Node Credit Balance alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "160"
              + "__dashboardUid__" = "GUakfOpMk"
              + "__panelId__"      = "16"
              + "message"          = "An EC2 instance has used its CPU Credit Balance. Performance issues may be encountered on this Kubernetes node, please check node CPU usage and take action to resolve or consider upgrading or changing the node instance type."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "f06c1563-dd85-46a9-8755-f25b37521fdf"
            }
          + name           = "EC2 Worker Node Credit Balance alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "edp232mk1y58gc"
              + model          = jsonencode(
                    {
                      + alias      = ""
                      + dimensions = {
                          + InstanceId = "*"
                        }
                      + expression = ""
                      + id         = ""
                      + matchExact = true
                      + metricName = "CPUCreditBalance"
                      + namespace  = "AWS/EC2"
                      + period     = "300"
                      + refId      = "A"
                      + region     = "default"
                      + statistics = [
                          + "Average",
                        ]
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 1,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Failed Restore Counts alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Failed Restore Counts alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "180"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "28"
              + "message"          = "A Velero restore to the cluster has failed.  Please use the Velero CLI to retrieve the backup logs to assist in investigation of the issue."
            }
          + condition      = "C"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "d489cd0d-896c-4d16-9abb-355d37f2c4a6"
            }
          + name           = "Failed Restore Counts alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_failed_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_partial_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "C"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Fluentd  daemonset running timeseries alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Fluentd  daemonset running timeseries alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "163"
              + "__dashboardUid__" = "70pnQaxZz"
              + "__panelId__"      = "16"
              + "message"          = "One or more fluentd pods are not running"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "cff9b7b0-449a-4f0c-9a3c-08bbf47ef925"
            }
          + name           = "Fluentd  daemonset running timeseries alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(up{pod=~\"fluentd.*\"}) by (service) - sum(up{pod=~\"fluentd.*\"}) by (service)"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{service}}"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Fluentd available buffer space ratio alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Fluentd available buffer space ratio alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "164"
              + "__dashboardUid__" = "70pnQaxZz"
              + "__panelId__"      = "10"
              + "message"          = "Available buffer space is below 25% for at least one fluentd pod."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e3f65059-6c23-4670-b2b8-f812a008cad5"
            }
          + name           = "Fluentd available buffer space ratio alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 25,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "fluentd_output_status_buffer_available_space_ratio"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{pod}}"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Goldpinger.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Goldpinger alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "165"
              + "__dashboardUid__" = "D4EyPQTWk"
              + "__panelId__"      = "25"
              + "message"          = "Goldpinger instance has been reporting unhealthy nodes for at least 5 minutes."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ddc49fdf-cf2b-40a3-b121-2f60bddbfe23"
            }
          + name           = "Goldpinger alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum(goldpinger_nodes_health_total{status=\"unhealthy\"}) by (goldpinger_instance)"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{ goldpinger_instance }}"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Is cluster version past EOL.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Is cluster version past EOL"

      + rule {
          + annotations    = {
              + "__alertId__"      = "162"
              + "__dashboardUid__" = "YMBzktpGz"
              + "__panelId__"      = "16"
              + "message"          = "Current cluster version is past EOL"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ebdbc94a-a7e2-44ed-8bca-60dcc7f9e988"
            }
          + name           = "Is cluster version past EOL"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource     = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + expr           = "eks_version_exporter_is_past_eol"
                      + format         = "time_series"
                      + instant        = false
                      + intervalFactor = 1
                      + legendFormat   = "is_outdated"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 60
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.9,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Kafka-exporter up alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Kafka-exporter up alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "167"
              + "__dashboardUid__" = "CoYn_3-nk"
              + "__panelId__"      = "2"
              + "message"          = "Kafka-exporter metrics cannot be scraped either because it is down or the scrape timeout is excided"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e64ff644-e9ac-4077-8337-4a56bf57097f"
            }
          + name           = "Kafka-exporter up alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + exemplar     = true
                      + expr         = "up{job=\"kafka-exporter\"}"
                      + interval     = ""
                      + legendFormat = "{{job}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.